w7d3/MusicApp/MusicApp/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "yaya"], ["created_at", "2020-09-09 23:48:52.135568"], ["updated_at", "2020-09-09 23:48:52.135568"]]
---
    def create
        @band = Band.new(params.require(:band).permit(:name))
        if @band.save!