w7d3/MusicApp/MusicApp/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(params.require(:user).permit(:email, :password))

        if @user.save!