w7d4/milestones/milestones/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Will Smithty"], ["password_digest", "$2a$12$59k.IUvfCK42Jfh33YLl6OmeRuDsudz4zpGOme9v75HGYATcPII0S"], ["session_token", "4_gnBT7DXsZ64CMNZjbopw"]]
---
    def create
        @user = User.new(user_params)
        # debugger
        if @user.save