w6d5/cats99/cats99/app/controllers/cats_controller.rb

    def create #put debugger into here to see what our params are
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("name", "birthdate", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

     def update
        @cat = Cat.find(params[:id]) # find the user
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birthdate" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["birthdate", "2017-01-02"], ["color", "black"], ["description", "<3"], ["updated_at", "2020-09-04 23:49:18.073698"], ["id", 2]]